Cases/container/container_no_outside_no_solid/constant/airInside/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// air
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }
// inlet
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }
// outlet
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }

airInside_to_box
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.9 0.9);
        emissivity      (0.9 0.9);
    };
}

// trailer
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.9 0.9);
//         emissivity      (0.9 0.9);
//     };
// }

// lkw
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.9 0.9);
//         emissivity      (0.9 0.9);
//     };
// }
container
{
    // type                boundaryRadiation;
    // mode                lookup;
    // emissivity          uniform 1.0;
    // absorptivity        uniform 1.0;
    // transmissivity      uniform 0.0;
type        opaqueDiffusive;

    // Fraction of the reflected is diffussive
    //fd          0.0; // 0: all specular 1: all diffusive


    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.6 0.6);
        emissivity      (0.6 0.6);
    };
}

// ************************************************************************* //
