Cases/container/container_no_outside_no_solid/system/box/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 285;

    boundaryField
    {
        container
        {
            type zeroGradient;
        }
        box_to_airInside
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            qrNbr           none;
            qr              none;
            // thicknessLayers (0.002);
            // kappaLayers     (40);
            kappa           none;
            thermalInertia  true;
            value           $internalField;
        }
    }
}

p
{
    internalField   uniform 100000;

    boundaryField
    {
    }
}

// ************************************************************************* //
